Revit 2027 API
IFCImportOptions.SetExtraOptions Method
 Set the list of extra options to be passed into the importer. Each entry in the map is a pair of option name and value. Note that any value here will overwrite the other values in the IFCImportOptions, if it has the same name.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetExtraOptions(
	IDictionary<string, string> options
)
Public Sub SetExtraOptions (
	options As IDictionary(Of String, String)
)
public:
void SetExtraOptions(
	IDictionary<String^, String^>^ options
)
member SetExtraOptions :
        options : IDictionary<string, string> -> unit
Parameters
options IDictionary<String, String>
 The list of options.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
IFCImportOptions Class
Autodesk.Revit.DB.IFC Namespace